{
  "layers": [
    {
      "idx": 0,
      "name": "input_layer",
      "class_name": "InputLayer",
      "layer_config": { "batch_input_shape": [null, 28, 28, 1] },
      "inbound_nodes": []
    },
    {
      "idx": 1,
      "name": "conv2d",
      "class_name": "Conv2D",
      "layer_config": {
        "filters": 6,
        "kernel_size": [5, 5],
        "strides": [1, 1],
        "padding": "valid",
        "activation": "tanh"
      },
      "inbound_nodes": [
        {
          "args": [
            { "name": "input_layer", "idx": 0, "shape": [null, 28, 28, 1] }
          ],
          "kwargs": {}
        }
      ]
    },
    {
      "idx": 2,
      "name": "max_pooling2d",
      "class_name": "MaxPooling2D",
      "layer_config": {
        "pool_size": [2, 2],
        "strides": [2, 2],
        "padding": "valid"
      },
      "inbound_nodes": [
        {
          "args": [{ "name": "conv2d", "idx": 1, "shape": [null, 24, 24, 6] }],
          "kwargs": {}
        }
      ]
    },
    {
      "idx": 3,
      "name": "conv2d_1",
      "class_name": "Conv2D",
      "layer_config": {
        "filters": 16,
        "kernel_size": [5, 5],
        "strides": [1, 1],
        "padding": "valid",
        "activation": "tanh"
      },
      "inbound_nodes": [
        {
          "args": [
            { "name": "max_pooling2d", "idx": 2, "shape": [null, 12, 12, 6] }
          ],
          "kwargs": {}
        }
      ]
    },
    {
      "idx": 4,
      "name": "max_pooling2d_1",
      "class_name": "MaxPooling2D",
      "layer_config": {
        "pool_size": [2, 2],
        "strides": [2, 2],
        "padding": "valid"
      },
      "inbound_nodes": [
        {
          "args": [{ "name": "conv2d_1", "idx": 3, "shape": [null, 8, 8, 16] }],
          "kwargs": {}
        }
      ]
    },
    {
      "idx": 5,
      "name": "flatten",
      "class_name": "Flatten",
      "layer_config": {},
      "inbound_nodes": [
        {
          "args": [
            { "name": "max_pooling2d_1", "idx": 4, "shape": [null, 4, 4, 16] }
          ],
          "kwargs": {}
        }
      ]
    },
    {
      "idx": 6,
      "name": "dense",
      "class_name": "Dense",
      "layer_config": { "units": 120, "activation": "tanh" },
      "inbound_nodes": [
        {
          "args": [{ "name": "flatten", "idx": 5, "shape": [null, 256] }],
          "kwargs": {}
        }
      ]
    },
    {
      "idx": 7,
      "name": "dense_1",
      "class_name": "Dense",
      "layer_config": { "units": 84, "activation": "tanh" },
      "inbound_nodes": [
        {
          "args": [{ "name": "dense", "idx": 6, "shape": [null, 120] }],
          "kwargs": {}
        }
      ]
    },
    {
      "idx": 8,
      "name": "dense_2",
      "class_name": "Dense",
      "layer_config": { "units": 10, "activation": "softmax" },
      "inbound_nodes": [
        {
          "args": [{ "name": "dense_1", "idx": 7, "shape": [null, 84] }],
          "kwargs": {}
        }
      ]
    }
  ],
  "class_name": "Functional"
}
